dejwk/roo_display/src/roo_display/hal/esp32/spi.h
#pragma once

#if defined(ARDUINO)
#include <Arduino.h>
#include <SPI.h>
#else
#include "driver/spi_master.h"
#include "esp_err.h"
#endif

#ifndef ROO_TESTING

#include <cstring>

#include "roo_backport.h"
#include "roo_backport/byte.h"
#include "roo_display/hal/esp32/memory.h"
#include "roo_display/hal/esp32/spi_async.h"
#include "roo_display/hal/esp32/spi_config.h"
#include "roo_display/hal/esp32/spi_dma.h"
#include "roo_display/hal/esp32/spi_irq.h"
#include "roo_display/hal/esp32/spi_reg.h"
#include "roo_display/hal/spi_settings.h"
#include "roo_io/data/byte_order.h"
#include "roo_io/memory/fill.h"
#include "roo_logging.h"
#include "soc/spi_reg.h"

namespace roo_display {
namespace esp32 {

template <uint8_t spi_port, typename SpiSettings>
class Esp32SpiDevice;

template <uint8_t spi_port>
class Esp32Spi {
 public:
  template <typename SpiSettings>
  using Device = Esp32SpiDevice<spi_port, SpiSettings>;

#if defined(ARDUINO)
  Esp32Spi() : spi_(SPI) {
    static_assert(
        spi_port == ROO_DISPLAY_ESP32_SPI_DEFAULT_PORT,
        "When using a SPI interface different than the default, you must "
        "provide a SPIClass object also in the constructor.");
  }

  Esp32Spi(decltype(SPI)& spi) : spi_(spi) {}

  void init() { spi_.begin(); }

  void init(uint8_t sck, uint8_t miso, uint8_t mosi) {
    spi_.begin(sck, miso, mosi);
  }

#else
  // The host enum is one-off from the spi_port.
  Esp32Spi() : spi_((spi_host_device_t)(spi_port - 1)) {}

  void init() {
    spi_bus_config_t config = {
        .mosi_io_num = -1,
        .miso_io_num = -1,
        .sclk_io_num = -1,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4096,
    };
    ESP_ERROR_CHECK(spi_bus_initialize(spi_, &config, SPI_DMA_CH_AUTO));
  }

  void init(uint8_t sck, uint8_t miso, uint8_t mosi) {
    spi_bus_config_t config = {
        .mosi_io_num = mosi,
        .miso_io_num = miso,
        .sclk_io_num = sck,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4096,
    };
    ESP_ERROR_CHECK(spi_bus_initialize(spi_, &config, SPI_DMA_CH_AUTO));
  }

#endif

 private:
  template <uint8_t, typename SpiSettings>
  friend class Esp32SpiDevice;

#if defined(ARDUINO)
  decltype(SPI)& spi_;
#else
  spi_host_device_t spi_;
#endif
};

// Note: hardcoding the spi_port, making register accesses compile-time
// constants, does bring tangible performance improvements; ~2% in 'Lines' test
// in the Adafruit benchmark.
template <uint8_t spi_port, typename SpiSettings>
class Esp32SpiDevice {
 public:
  // friend void IRAM_ATTR TransferCompleteISR(void* arg);
  Esp32SpiDevice(Esp32Spi<spi_port>& spi)
      : spi_(spi.spi_),
        async_op_(),
        irq_binding_{AsyncOperation<spi_port>::TransferCompleteISR,
                     &async_op_} {}

  Esp32SpiDevice(const Esp32SpiDevice&) = delete;
  Esp32SpiDevice& operator=(const Esp32SpiDevice&) = delete;

#if defined(ARDUINO)
  Esp32SpiDevice(Esp32SpiDevice&& other) noexcept
      : spi_(other.spi_),
        async_op_(),
        irq_binding_{AsyncOperation<spi_port>::TransferCompleteISR,
                     &async_op_} {}
#else
  Esp32SpiDevice(Esp32SpiDevice&& other) noexcept
      : spi_(other.spi_),
        device_(other.device_),
        async_op_(),
        irq_binding_{AsyncOperation<spi_port>::TransferCompleteISR,
                     &async_op_} {}
#endif

  Esp32SpiDevice& operator=(Esp32SpiDevice&&) = delete;

  void init() {
    spi_async_mode_ = GetSpiAsyncMode();
#if !defined(ARDUINO)
    spi_device_interface_config_t config_ = {
        .command_bits = 0,
        .address_bits = 0,
        .dummy_bits = 0,
        .mode = SpiSettings::data_mode,
        .clock_source = SPI_CLK_SRC_DEFAULT,
        .duty_cycle_pos = 128,
        .cs_ena_pretrans = 0,
        .cs_ena_posttrans = 0,
        .clock_speed_hz = SpiSettings::clock,
        .input_delay_ns = 0,
        .spics_io_num = -1,
        .flags = {SpiSettings::bit_order == kSpiLsbFirst
                      ? SPI_DEVICE_BIT_LSBFIRST
                      : 0},
        .queue_size = 1,
    };
    ESP_ERROR_CHECK(spi_bus_add_device(spi_, &config_, &device_));
#endif
    if (spi_async_mode_ == 3) {
      dma_controller_ = GetDmaControllerForHost(spi_port);
    }
  }

  void beginReadWriteTransaction() {
#if defined(ARDUINO)
    spi_.beginTransaction(SPISettings(
        SpiSettings::clock, SpiSettings::bit_order, SpiSettings::data_mode));
#else
    spi_device_acquire_bus(device_, portMAX_DELAY);
#endif
  }

  void beginWriteOnlyTransaction() {
#if defined(ARDUINO)
    spi_.beginTransaction(SPISettings(
        SpiSettings::clock, SpiSettings::bit_order, SpiSettings::data_mode));
#else
    spi_device_acquire_bus(device_, portMAX_DELAY);
#endif
    SpiSetWriteOnlyMode(spi_port);
    if (spi_async_mode_ == 3) {
      CHECK(ensureDmaReady());
    }
  }

  void endTransaction() {
    flush();
    SpiSetReadWriteMode(spi_port);
    if (dma_irq_bound_ && dma_controller_ != nullptr) {
      dma_controller_->unbindInterrupt();
      dma_irq_bound_ = false;
    }
    unbindInterrupt();
#if defined(ARDUINO)
    spi_.endTransaction();
#else
    spi_device_release_bus(device_);
#endif
  }

  void flush() __attribute__((always_inline)) {
    if (!need_sync_) return;
    need_sync_ = false;
    if (!async_op_pending_) {
      SpiTxWait(spi_port);
      return;
    }

    if (spi_async_mode_ == 3 && dma_controller_ != nullptr) {
      if (dma_work_buffer_.data != nullptr && dma_work_buffer_used_ > 0) {
        dma_controller_->awaitCompleted();
        SpiTxWait(spi_port);
        writeBytesSyncFallback(dma_work_buffer_.data, dma_work_buffer_used_);
        // dma_controller_->releaseBuffer(dma_work_buffer_);
        // dma_work_buffer_ = {nullptr};
        dma_work_buffer_used_ = 0;
        SpiTxWait(spi_port);
        // if (dma_work_buffer_used_ >= 64) {
        //   const size_t aligned =
        //       dma_work_buffer_used_ & ~static_cast<size_t>(3);
        //   const size_t remainder = dma_work_buffer_used_ - aligned;
        //   alignas(4) roo::byte tail[3];
        //   if (remainder > 0) {
        //     __builtin_memcpy(tail, dma_work_buffer_.data + aligned,
        //     remainder);
        //   }
        //   dma_work_buffer_used_ = aligned;
        //   submitWorkingDmaBuffer();
        //   dma_controller_->awaitCompleted();
        //   if (remainder > 0) {
        //     syncWriteBytesNoFlush(tail, remainder);
        //     need_sync_ = false;
        //     SpiTxWait(spi_port);
        //   }
        // } else {
        //   // Too small for opportunistic DMA publish in flush; transmit sync.
        //   alignas(4) roo::byte scratch[64];
        //   const size_t len = dma_work_buffer_used_;
        //   __builtin_memcpy(scratch, dma_work_buffer_.data, len);
        //   dma_controller_->releaseBuffer(dma_work_buffer_);
        //   dma_work_buffer_ = {nullptr};
        //   dma_work_buffer_used_ = 0;
        //   dma_controller_->awaitCompleted();
        //   syncWriteBytesNoFlush(scratch, len);
        //   need_sync_ = false;
        //   SpiTxWait(spi_port);
        // }
      } else {
        dma_controller_->awaitCompleted();
      }
      async_op_pending_ = false;
      // Mode-3 can mix DMA and direct sync transfers (small-transfer bypass).
      // Ensure any in-flight sync transfer has also completed.
      return;
    }
    // Mode 2 keeps completion fully ISR-driven. Other modes eagerly finish in
    // task context when a waiter blocks.
    async_op_.awaitCompletion(spi_async_mode_ != 2);
    async_op_pending_ = false;
    need_sync_ = false;
  }

  void write(uint8_t data) __attribute__((always_inline)) {
    // if (spi_async_mode_ == 3) {
    //   roo::byte b = static_cast<roo::byte>(data);
    //   if (appendDmaBytes(&b, 1)) return;
    // }
    flush();
    SpiSetOutBufferSize(spi_port, 1);
    SpiWrite4(spi_port, static_cast<uint32_t>(data));
    SpiTxStart(spi_port);
    need_sync_ = true;
  }

  void write16(uint16_t data) __attribute__((always_inline)) {
    // if (spi_async_mode_ == 3) {
    //   uint16_t be = roo_io::htobe(data);
    //   if (appendDmaBytes(reinterpret_cast<const roo::byte*>(&be), 2)) {
    //     submitWorkingDmaBufferIfLineIdle();
    //     return;
    //   }
    // }
    flush();
    SpiSetOutBufferSize(spi_port, 2);
    SpiWrite4(spi_port, roo_io::htobe(data));
    SpiTxStart(spi_port);
    need_sync_ = true;
  }

