dejwk/roo_display/src/roo_display/hal/esp32/spi.h
  void write16x2(uint16_t a, uint16_t b) __attribute((always_inline)) {
    // if (spi_async_mode_ == 3) {
    //   uint16_t payload[2] = {roo_io::htobe(a), roo_io::htobe(b)};
    //   if (appendDmaBytes(reinterpret_cast<const roo::byte*>(payload), 4)) {
    //     return;
    //   }
    // }
    flush();
    SpiSetOutBufferSize(spi_port, 4);
    SpiWrite4(spi_port, roo_io::htobe(a) | (roo_io::htobe(b) << 16));
    SpiTxStart(spi_port);
    need_sync_ = true;
  }

  void writeBytes(const roo::byte* data, uint32_t len) {
    if (spi_async_mode_ == 3 && appendDmaBytes(data, len)) {
      return;
    }
    flush();
    uintptr_t misalign = reinterpret_cast<uintptr_t>(data) & 0x3u;
    if (misalign != 0) {
      uint32_t prefix = 4 - static_cast<uint32_t>(misalign);
      if (prefix > len) prefix = len;
      uint32_t word = 0;
      __builtin_memcpy(&word, data, prefix);
      SpiSetOutBufferSize(spi_port, prefix);
      SpiWrite4(spi_port, word);
      SpiTxStart(spi_port);
      len -= prefix;
      if (len == 0) {
        need_sync_ = true;
        return;
      }
      data += prefix;
      SpiTxWait(spi_port);
    }
    // const uint32_t* d32 = reinterpret_cast<const uint32_t*>(data);
    if (len >= 64) {
      SpiSetOutBufferSize(spi_port, 64);
      while (true) {
        SpiWrite64Aligned(spi_port, data);
        SpiTxStart(spi_port);
        len -= 64;
        if (len == 0) {
          need_sync_ = true;
          return;
        }
        data += 64;
        SpiTxWait(spi_port);
        if (len < 64) break;
      }
    }
    SpiSetOutBufferSize(spi_port, len);
    SpiWriteUpTo64Aligned(spi_port, data, len);
    SpiTxStart(spi_port);
    need_sync_ = true;
  }

  void writeBytesSyncFallback(const roo::byte* data, uint32_t len) {
    // flush();
    uintptr_t misalign = reinterpret_cast<uintptr_t>(data) & 0x3u;
    if (misalign != 0) {
      uint32_t prefix = 4 - static_cast<uint32_t>(misalign);
      if (prefix > len) prefix = len;
      uint32_t word = 0;
      __builtin_memcpy(&word, data, prefix);
      SpiSetOutBufferSize(spi_port, prefix);
      SpiWrite4(spi_port, word);
      SpiTxStart(spi_port);
      len -= prefix;
      if (len == 0) {
        need_sync_ = true;
        return;
      }
      data += prefix;
      SpiTxWait(spi_port);
    }
    if (len >= 64) {
      SpiSetOutBufferSize(spi_port, 64);
      while (true) {
        SpiWrite64Aligned(spi_port, data);
        SpiTxStart(spi_port);
        len -= 64;
        if (len == 0) {
          need_sync_ = true;
          return;
        }
        data += 64;
        SpiTxWait(spi_port);
        if (len < 64) break;
      }
    }
    SpiSetOutBufferSize(spi_port, len);
    SpiWriteUpTo64Aligned(spi_port, data, len);
    SpiTxStart(spi_port);
    need_sync_ = true;
  }

  void fill16(const roo::byte* data, uint32_t repetitions) {
    if (spi_async_mode_ == 3) {
      if (!need_sync_) {
        uint32_t lrep = repetitions < 32 ? repetitions : 32;
        uint16_t hi = static_cast<uint16_t>(data[1]);
        uint16_t lo = static_cast<uint16_t>(data[0]);
        uint16_t d16 = (hi << 8) | lo;
        uint32_t d32 = (d16 << 16) | d16;
        uint32_t len = lrep * 2;
        SpiSetOutBufferSize(spi_port, len);
        SpiFillUpTo64(spi_port, d32, len);
        SpiTxStart(spi_port);
        need_sync_ = true;
        repetitions -= lrep;
        if (repetitions == 0) {
          return;
        }
      }
      if (appendDmaRepeated(data, 2, repetitions)) {
        submitWorkingDmaBufferIfLineIdle();
        return;
      }
    }
    // Note: ESP32 is little-endian, so we're byte-swapping to
    // get the bytes sorted correctly in the output register.
    uint16_t hi = static_cast<uint16_t>(data[1]);
    uint16_t lo = static_cast<uint16_t>(data[0]);
    uint16_t d16 = (hi << 8) | lo;
    uint32_t d32 = (d16 << 16) | d16;
    uint32_t len = repetitions * 2;
    if (len < 64) {
      flush();
      SpiSetOutBufferSize(spi_port, len);
      SpiFillUpTo64(spi_port, d32, len);
      SpiTxStart(spi_port);
      need_sync_ = true;
      return;
    }

    uint32_t rem = len & 63;
    flush();
    SpiFill64(spi_port, d32);
    if (rem != 0) {
      SpiSetOutBufferSize(spi_port, rem);
      SpiTxStart(spi_port);
      len -= rem;
      SpiTxWait(spi_port);
    }
    SpiSetOutBufferSize(spi_port, 64);

    if (spi_async_mode_ != 0 && bindInterrupt()) {
      async_op_pending_ = true;
      need_sync_ = true;
      async_op_.initFill(len);
      SpiNonDmaTransferDoneIntClear(spi_port);
      SpiNonDmaTransferDoneIntEnable(spi_port);
      SpiTxStart(spi_port);
      return;
    }

    // Sync fallback.
    while (true) {
      SpiTxStart(spi_port);
      len -= 64;
      if (len == 0) {
        need_sync_ = true;
        return;
      }
      SpiTxWait(spi_port);
    }
  }

  void fill24(const roo::byte* data, uint32_t repetitions) {
    if (spi_async_mode_ == 3 && appendDmaRepeated(data, 3, repetitions)) {
      submitWorkingDmaBufferIfLineIdle();
      return;
    }
    uint32_t r = static_cast<uint8_t>(data[0]);
    uint32_t g = static_cast<uint8_t>(data[1]);
    uint32_t b = static_cast<uint8_t>(data[2]);
    // Concatenate 4 pixels into three 32 bit blocks.
    uint32_t d2 = b | r << 8 | g << 16 | b << 24;
    uint32_t d1 = d2 << 8 | g;
    uint32_t d0 = d1 << 8 | r;
    uint32_t len = repetitions * 3;
    if (len < 60) {
      flush();
      SpiSetOutBufferSize(spi_port, len);
      SpiFillUpTo60(spi_port, d0, d1, d2, len);
      SpiTxStart(spi_port);
      need_sync_ = true;
      return;
    }

    uint32_t rem = len % 60;
    flush();
    SpiFill60(spi_port, d0, d1, d2);
    if (rem != 0) {
      SpiSetOutBufferSize(spi_port, rem);
      SpiTxStart(spi_port);
      len -= rem;
      SpiTxWait(spi_port);
    }
    SpiSetOutBufferSize(spi_port, 60);
    while (true) {
      SpiTxStart(spi_port);
      len -= 60;
      if (len == 0) {
        need_sync_ = true;
        return;
      }
      SpiTxWait(spi_port);
    }
  }

  // The source buffer must remain valid and unchanged until completion
  // (flush()/endTransaction()/next synchronous operation), same contract as
  // DisplayDevice::drawDirectRectAsync.
  void asyncBlit(const roo::byte* data, size_t row_stride_bytes,
                 size_t row_bytes, size_t row_count) {
    if (row_stride_bytes == row_bytes) {
      row_bytes = row_bytes * row_count;
      row_stride_bytes = row_bytes;
      row_count = 1;
    }

    if (spi_async_mode_ == 3) {
      // CHECK(ensureDmaReady());
      if (!need_sync_ && row_bytes * row_count <= 64) {
        syncBlitFallback(data, row_stride_bytes, row_bytes, row_count);
        return;
      }
      if (row_stride_bytes == row_bytes) {
        CHECK(appendDmaBytes(data, row_bytes * row_count));
        submitWorkingDmaBufferIfLineIdle();
        return;
      } else {
        const roo::byte* row = data;
        for (size_t i = 0; i < row_count; ++i) {
          CHECK(appendDmaBytes(row, row_bytes));
          row += row_stride_bytes;
        }
        submitWorkingDmaBufferIfLineIdle();
      }
      return;
    }

    ++async_blit_stats_.requests;
    bool source_internal = IsInternalMemory(data);
    if (source_internal) {
      ++async_blit_stats_.internal_source;
    } else {
      ++async_blit_stats_.non_internal_source;
    }

    bool async_eligible = spi_async_mode_ != 0 && source_internal &&
                          (row_bytes * row_count >= 64);
    if (!async_eligible) {
      ++async_blit_stats_.fallback_non_internal;
      syncBlitFallback(data, row_stride_bytes, row_bytes, row_count);
      return;
    }

    ++async_blit_stats_.eligible_internal;
    if (!bindInterrupt()) {
      syncBlitFallback(data, row_stride_bytes, row_bytes, row_count);
      return;
    }
    flush();
    async_op_.initBlit(data, row_stride_bytes, row_bytes, row_count);
    ++async_blit_stats_.async_started;
    async_op_pending_ = true;
    need_sync_ = true;
    SpiNonDmaTransferDoneIntClear(spi_port);
    SpiNonDmaTransferDoneIntEnable(spi_port);
    SpiSetOutBufferSize(spi_port, 64);
    SpiTxStart(spi_port);
    return;
    ++async_blit_stats_.fallback_async_init_failed;
  }

  roo::byte transfer(roo::byte data) __attribute__((always_inline)) {
    SpiSetTxBufferSize(spi_port, 1);
    SpiWrite4(spi_port, static_cast<uint32_t>(data));
    SpiTxStart(spi_port);
    SpiTxWait(spi_port);
    return static_cast<roo::byte>(SpiRead4(spi_port) & 0xFF);
  }

  uint16_t transfer16(uint16_t data) __attribute__((always_inline)) {
    // Apply byte-swapping for MSBFIRST (wr_bit_order = 0)
    data = roo_io::htobe(data);
    SpiSetTxBufferSize(spi_port, 2);
    SpiWrite4(spi_port, data);
    SpiTxStart(spi_port);
    SpiTxWait(spi_port);
    uint16_t result = SpiRead4(spi_port) & 0xFFFF;
    // Apply byte-swapping for MSBFIRST (rd_bit_order = 0)
    return roo_io::betoh(result);
  }

