dejwk/roo_display/src/roo_display/hal/esp32/spi.h
 private:
  inline static int GetSpiAsyncMode() {
    int mode = GET_ROO_FLAG(roo_display_esp32_spi_async);
    if (mode <= 0) return 0;
    if (mode >= 3) return 3;
    return mode;
  }

  bool ensureDmaReady() {
    if (spi_async_mode_ != 3 || dma_controller_ == nullptr) return false;
    if (dma_irq_bound_) return true;
    if (!dma_controller_->bindInterrupt()) return false;
    dma_irq_bound_ = true;
    return true;
  }

  void submitWorkingDmaBuffer(size_t repetitions = 1) {
    SpiTxWait(spi_port);
    if (dma_work_buffer_.data == nullptr || dma_work_buffer_used_ == 0) {
      return;
    }
    CHECK_NOTNULL(dma_controller_);
    bool ok = dma_controller_->submit(DmaController::Operation{
        dma_work_buffer_.data, dma_work_buffer_used_, repetitions});
    CHECK(ok);
    async_op_pending_ = true;
    dma_work_buffer_ = {nullptr};
    dma_work_buffer_used_ = 0;
    need_sync_ = true;
  }

  void rotatePattern2(const roo::byte* pattern, size_t phase,
                      roo::byte* rotated) __attribute__((always_inline)) {
    if ((phase & 1) == 0) {
      rotated[0] = pattern[0];
      rotated[1] = pattern[1];
    } else {
      rotated[0] = pattern[1];
      rotated[1] = pattern[0];
    }
  }

  void rotatePattern3(const roo::byte* pattern, size_t phase,
                      roo::byte* rotated) __attribute__((always_inline)) {
    switch (phase % 3) {
      case 0:
        rotated[0] = pattern[0];
        rotated[1] = pattern[1];
        rotated[2] = pattern[2];
        break;
      case 1:
        rotated[0] = pattern[1];
        rotated[1] = pattern[2];
        rotated[2] = pattern[0];
        break;
      default:
        rotated[0] = pattern[2];
        rotated[1] = pattern[0];
        rotated[2] = pattern[1];
        break;
    }
  }

  size_t fillPatternBytes(roo::byte* dst, size_t len, const roo::byte* pattern,
                          size_t pattern_bytes, size_t phase)
      __attribute__((always_inline)) {
    if (len == 0) return phase;
    alignas(4) roo::byte rotated[3];
    if (pattern_bytes == 2) {
      rotatePattern2(pattern, phase, rotated);
      size_t full = len / 2;
      if (full > 0) {
        roo_io::PatternFill<2>(dst, full, rotated);
        dst += full * 2;
      }
      if ((len & 1) != 0) {
        *dst = rotated[0];
      }
      return (phase + len) & 1;
    } else {
      rotatePattern3(pattern, phase, rotated);
      size_t full = len / 3;
      if (full > 0) {
        roo_io::PatternFill<3>(dst, full, rotated);
        dst += full * 3;
      }
      size_t rem = len - full * 3;
      if (rem != 0) {
        __builtin_memcpy(dst, rotated, rem);
      }
      return (phase + len) % 3;
    }
  }

  void submitWorkingDmaBufferIfLineIdle() {
    if (spi_async_mode_ != 3 || dma_controller_ == nullptr) return;
    if (dma_work_buffer_.data == nullptr || dma_work_buffer_used_ == 0) return;
    bool line_idle = !SpiTxBusy(spi_port);
    if (!line_idle) return;
    if (dma_work_buffer_used_ < 64) {
      // alignas(4) roo::byte scratch[64];
      const size_t len = dma_work_buffer_used_;
      syncWriteBytesNoFlush(dma_work_buffer_.data, len);
      // const size_t len = dma_work_buffer_used_;
      // __builtin_memcpy(scratch, dma_work_buffer_.data, len);
      // dma_controller_->releaseBuffer(dma_work_buffer_);
      // dma_work_buffer_ = {nullptr};
      dma_work_buffer_used_ = 0;
      async_op_pending_ = false;
      return;
    }
    // if (dma_work_buffer_used_ <= 256) return;

    const size_t aligned = dma_work_buffer_used_ & ~static_cast<size_t>(3);
    // if (aligned < 64) return;
    const size_t remainder = dma_work_buffer_used_ - aligned;
    alignas(4) roo::byte tail[3];
    if (remainder > 0) {
      __builtin_memcpy(tail, dma_work_buffer_.data + aligned, remainder);
    }
    dma_work_buffer_used_ = aligned;
    submitWorkingDmaBuffer();
    if (remainder > 0) {
      dma_work_buffer_ = dma_controller_->acquireBuffer();
      CHECK_NOTNULL(dma_work_buffer_.data);
      __builtin_memcpy(dma_work_buffer_.data, tail, remainder);
      dma_work_buffer_used_ = remainder;
      async_op_pending_ = true;
      need_sync_ = true;
    }
  }

  void syncWriteBytesNoFlush(const roo::byte* data, size_t len) {
    SpiSetOutBufferSize(spi_port, len);
    SpiWriteUpTo64Aligned(spi_port, data, len);
    SpiTxStart(spi_port);
    need_sync_ = true;
  }

  bool appendDmaBytes(const roo::byte* data, size_t len) {
    if (len == 0) return true;
    size_t capacity = dma_controller_->bufferCapacity();
    while (len != 0) {
      if (dma_work_buffer_.data == nullptr) {
        dma_work_buffer_ = dma_controller_->acquireBuffer();
        CHECK_NOTNULL(dma_work_buffer_.data);
        dma_work_buffer_used_ = 0;
      }
      size_t available = capacity - dma_work_buffer_used_;
      size_t chunk = (len < available) ? len : available;
      __builtin_memcpy(dma_work_buffer_.data + dma_work_buffer_used_, data,
                       chunk);
      dma_work_buffer_used_ += chunk;
      async_op_pending_ = true;
      data += chunk;
      len -= chunk;
      if (dma_work_buffer_used_ == capacity) {
        submitWorkingDmaBuffer();
      }
    }
    need_sync_ = true;
    return true;
  }

  bool appendDmaRepeated(const roo::byte* pattern, size_t pattern_bytes,
                         size_t repetitions) {
    if (repetitions == 0) return true;
    if (pattern_bytes != 2 && pattern_bytes != 3) return false;
    // if (!ensureDmaReady()) return false;
    if (repetitions * pattern_bytes <= 64) {
      if (dma_work_buffer_used_ == 0 && !SpiTxBusy(spi_port)) return false;
    }

    size_t capacity = dma_controller_->bufferCapacity();
    size_t remaining_bytes = repetitions * pattern_bytes;

    if (dma_work_buffer_.data == nullptr) {
      dma_work_buffer_ = dma_controller_->acquireBuffer();
      dma_work_buffer_used_ = 0;
    }
    // // If everything fits in the current buffer, write and return.
    // if (dma_work_buffer_.data != nullptr) {
    size_t available = capacity - dma_work_buffer_used_;
    if (remaining_bytes <= available) {
      roo::byte* dst = dma_work_buffer_.data + dma_work_buffer_used_;
      if (pattern_bytes == 2) {
        roo_io::PatternFill<2>(dst, repetitions, pattern);
      } else {
        roo_io::PatternFill<3>(dst, repetitions, pattern);
      }
      dma_work_buffer_used_ += remaining_bytes;
      async_op_pending_ = true;
      need_sync_ = true;
      return true;
    }
    // }

    // Fill pattern phase must be local to this fill call and must not depend
    // on whatever bytes may already be staged from previous operations.
    size_t phase = 0;

    // If there is data in the current buffer, fill it to the end and
    // publish.
    if (dma_work_buffer_.data != nullptr && dma_work_buffer_used_ > 0) {
      size_t available = capacity - dma_work_buffer_used_;
      phase = fillPatternBytes(dma_work_buffer_.data + dma_work_buffer_used_,
                               available, pattern, pattern_bytes, phase);
      dma_work_buffer_used_ = capacity;
      async_op_pending_ = true;
      remaining_bytes -= available;
      submitWorkingDmaBuffer();
    }
    if (dma_work_buffer_.data == nullptr) {
      dma_work_buffer_ = dma_controller_->acquireBuffer();
    }

    if (pattern_bytes == 2) {
      // Middle repeated-chunk fast path for 2-byte patterns.
      // Use a 4-byte aligned chunk size instead of full capacity.
      const size_t chunk2 = capacity - (capacity % 4);
      if (chunk2 >= 64 && remaining_bytes >= 2 * chunk2) {
        phase = fillPatternBytes(dma_work_buffer_.data, chunk2, pattern,
                                 pattern_bytes, phase);
        dma_work_buffer_used_ = chunk2;
        size_t op_repetitions = remaining_bytes / chunk2;
        submitWorkingDmaBuffer(op_repetitions);
        remaining_bytes -= op_repetitions * chunk2;
      }
    } else if (pattern_bytes == 3) {
      // Middle repeated-chunk fast path for 3-byte patterns.
      // Use a 12-byte aligned chunk size so chunk is aligned to 4 and keeps
      // pattern phase invariant across repeated submits.
      const size_t chunk3 = capacity - (capacity % 12);
      if (chunk3 >= 64 && remaining_bytes >= 2 * chunk3) {
        phase = fillPatternBytes(dma_work_buffer_.data, chunk3, pattern,
                                 pattern_bytes, phase);
        dma_work_buffer_used_ = chunk3;
        size_t op_repetitions = remaining_bytes / chunk3;
        submitWorkingDmaBuffer(op_repetitions);
        remaining_bytes -= op_repetitions * chunk3;
      }
    }

    // Fill and submit the remainder.
    if (remaining_bytes > 0) {
      if (dma_work_buffer_.data == nullptr) {
        dma_work_buffer_ = dma_controller_->acquireBuffer();
        dma_work_buffer_used_ = 0;
      }
      size_t available = capacity - dma_work_buffer_used_;
      roo::byte* dst = dma_work_buffer_.data + dma_work_buffer_used_;
      phase =
          fillPatternBytes(dst, remaining_bytes, pattern, pattern_bytes, phase);
      dma_work_buffer_used_ += remaining_bytes;
      async_op_pending_ = true;
      // if (dma_work_buffer_used_ == capacity) {
      //   submitWorkingDmaBuffer();
      // }
    }

    need_sync_ = true;
    return true;
  }

  struct AsyncBlitStats {
    uint32_t requests = 0;
    uint32_t internal_source = 0;
    uint32_t non_internal_source = 0;
    uint32_t eligible_internal = 0;
    uint32_t async_started = 0;
    uint32_t fallback_irq_unavailable = 0;
    uint32_t fallback_async_init_failed = 0;
    uint32_t fallback_non_internal = 0;
    uint32_t sync_fallbacks = 0;
  };

