dejwk/roo_display/src/roo_display/hal/esp32/spi.h
  bool bindInterrupt() {
    if (irq_dispatcher_ == nullptr) {
      if (irq_alloc_attempted_) return false;
      irq_alloc_attempted_ = true;
      irq_dispatcher_ = GetIrqDispatcher(spi_port);
      if (irq_dispatcher_ == nullptr) return false;
    }
    return irq_dispatcher_->bind(&irq_binding_);
  }

  void unbindInterrupt() {
    if (irq_dispatcher_ == nullptr) return;
    irq_dispatcher_->unbind(&irq_binding_);
    irq_dispatcher_ = nullptr;
    irq_alloc_attempted_ = false;
  }

  void syncBlitFallback(const roo::byte* data, size_t row_stride_bytes,
                        size_t row_bytes, size_t row_count) {
    ++async_blit_stats_.sync_fallbacks;
    const roo::byte* row = data;
    for (size_t i = 0; i < row_count; ++i) {
      flush();
      writeBytesSyncFallback(row, static_cast<uint32_t>(row_bytes));
      row += row_stride_bytes;
    }
  }

#if defined(ARDUINO)
  decltype(SPI)& spi_;
#else
  spi_host_device_t spi_;
  spi_device_handle_t device_;
#endif
  AsyncBlitStats async_blit_stats_;
  bool need_sync_ = false;
  bool async_op_pending_ = false;
  AsyncOperation<spi_port> async_op_;
  IrqDispatcher::Binding irq_binding_;
  IrqDispatcher* irq_dispatcher_ = nullptr;
  bool irq_alloc_attempted_ = false;
  // Caching this here does improve performance of tight loops slightly (e.g.
  // filled triangles benchmark: ~6% impact without it).
  int spi_async_mode_;
  DmaController* dma_controller_ = nullptr;
  bool dma_irq_bound_ = false;
  DmaBufferPool::Buffer dma_work_buffer_ = {nullptr};
  size_t dma_work_buffer_used_ = 0;
};

// Original ESP32: SPI0 (none), FSPI -> SPI1, HSPI -> SPI2, VSPI -> SPI3.
// ESP32S2/S3/P4: FSPI -> SPI2, HSPI -> SPI3.
// Others: FSPI -> SPI2.
//
// Based on
// https://github.com/espressif/arduino-esp32/blob/master/cores/esp32/esp32-hal-spi.h
// and
// https://github.com/espressif/arduino-esp32/blob/master/cores/esp32/esp32-hal-spi.c.
#if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || \
    CONFIG_IDF_TARGET_ESP32P4
using Fspi = Esp32Spi<2>;
using Hspi = Esp32Spi<3>;
#elif CONFIG_IDF_TARGET_ESP32
using Fspi = Esp32Spi<1>;
using Hspi = Esp32Spi<2>;
using Vspi = Esp32Spi<3>;
#else  // ESP32C2, C3, C5, C6, C61, H2
using Fspi = Esp32Spi<2>;
#endif

}  // namespace esp32
}  // namespace roo_display

#undef ROO_DISPLAY_SPI_ASYNC_ISR_ATTR

#else
// The SPI hardware is not emulated by roo_testing; we need to use a
// higher-level driver abstraction.

#include "roo_display/hal/arduino/spi.h"

namespace roo_display {
namespace esp32 {

#if CONFIG_IDF_TARGET_ESP32
using Vspi = ArduinoSpi;
using Hspi = ArduinoSpi;
#endif
using Fspi = ArduinoSpi;

}  // namespace esp32
}  // namespace roo_display

#endif
